Revit 2024 API
GenericImportOptions Class
Generic Import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class GenericImportOptions
Visual Basic
Public MustInherit Class GenericImportOptions
Visual C++
public ref class GenericImportOptions abstract
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GenericImportOptions
See Also
GenericImportOptions Members
Autodesk.Revit.DB Namespace